Autodesk.Revit.DB.SiteInsertServiceData.GetLinkLoadResult
Retrieves the LinkLoadResult of the attempt to load or reload a Topography link.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.SetLinkLoadResult(Autodesk.Revit.DB.LinkLoadResult)
Sets the LinkLoadResult
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SiteInsertServiceData.SessionId
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.ErrorType
Error type of link failure
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.DoReloadFrom
Determines whether to reload from.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.LinkTypeId
The ElementId of the TopographyLinkType.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.DoReload
Determines whether to insert or to reload.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.LinkId
Id of the created TopographyLink
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.IsRevitInAPIMode
Determines whether Revit is in API mode or not.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.Placement
Where to place the linked symbol element.
Set this option to place the view at the origin, the center, the base point, or a shared coordinates.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.Document
The current document.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData.FilePath
The path of the inserted file.
Since:
2018

Autodesk.Revit.DB.SiteInsertServiceData
The data associated with the site insert service.
Since:
2018